In [1]:
import openpyxl as oxl

print('openpyxl Ver : ', oxl.__version__)

openpyxl Ver :  3.0.5

In [2]:
from openpyxl import Workbook, load_workbook

In [3]:
wb2 = load_workbook('주소록.xlsx')
print(wb2.sheetnames)

ws = wb2['두번째시트']
print(type(ws))

['Sheet', '두번째시트', 'Sheet1', '네번째시트']
<class 'openpyxl.worksheet.worksheet.Worksheet'>

In [5]:
list(ws.iter_rows())

[(<Cell '두번째시트'.A1>, <Cell '두번째시트'.B1>, <Cell '두번째시트'.C1>),
 (<Cell '두번째시트'.A2>, <Cell '두번째시트'.B2>, <Cell '두번째시트'.C2>),
 (<Cell '두번째시트'.A3>, <Cell '두번째시트'.B3>, <Cell '두번째시트'.C3>),
 (<Cell '두번째시트'.A4>, <Cell '두번째시트'.B4>, <Cell '두번째시트'.C4>),
 (<Cell '두번째시트'.A5>, <Cell '두번째시트'.B5>, <Cell '두번째시트'.C5>),
 (<Cell '두번째시트'.A6>, <Cell '두번째시트'.B6>, <Cell '두번째시트'.C6>)]

In [6]:
for row in ws.iter_rows():
    for cell in row:
        print(cell, cell.value)

<Cell '두번째시트'.A1> 이름
<Cell '두번째시트'.B1> 전화번호
<Cell '두번째시트'.C1> 주소
<Cell '두번째시트'.A2> 홍길동
<Cell '두번째시트'.B2> 02-302-3333
<Cell '두번째시트'.C2> 광주
<Cell '두번째시트'.A3> 김길동
<Cell '두번째시트'.B3> 010-222-3334
<Cell '두번째시트'.C3> 부산
<Cell '두번째시트'.A4> 박길동
<Cell '두번째시트'.B4> 010-1234-1234
<Cell '두번째시트'.C4> 대구
<Cell '두번째시트'.A5> None
<Cell '두번째시트'.B5> 02-302-3333
<Cell '두번째시트'.C5> None
<Cell '두번째시트'.A6> 홍길동
<Cell '두번째시트'.B6> 7777777
<Cell '두번째시트'.C6> None

In [7]:
for col in ws.iter_cols():
    for cell in col:
        print(cell, cell.value)

<Cell '두번째시트'.A1> 이름
<Cell '두번째시트'.A2> 홍길동
<Cell '두번째시트'.A3> 김길동
<Cell '두번째시트'.A4> 박길동
<Cell '두번째시트'.A5> None
<Cell '두번째시트'.A6> 홍길동
<Cell '두번째시트'.B1> 전화번호
<Cell '두번째시트'.B2> 02-302-3333
<Cell '두번째시트'.B3> 010-222-3334
<Cell '두번째시트'.B4> 010-1234-1234
<Cell '두번째시트'.B5> 02-302-3333
<Cell '두번째시트'.B6> 7777777
<Cell '두번째시트'.C1> 주소
<Cell '두번째시트'.C2> 광주
<Cell '두번째시트'.C3> 부산
<Cell '두번째시트'.C4> 대구
<Cell '두번째시트'.C5> None
<Cell '두번째시트'.C6> None

# Pandas 이용한 내용 읽기

In [9]:
import pandas as pd

In [10]:
print(pd.__version__)

1.1.3

In [12]:
# numpy - C/C++로 만들어짐
# read_csv()
# read_excel()

In [13]:
dat = pd.read_excel('주소록.xlsx', sheet_name='두번째시트')
dat

    이름           전화번호   주소
0  홍길동    02-302-3333   광주
1  김길동   010-222-3334   부산
2  박길동  010-1234-1234   대구
3  NaN    02-302-3333  NaN
4  홍길동        7777777  NaN

In [24]:
a = list(dat.iterrows())
# print(len(a))
# print()
# print(a[0])
# print()
# print(a[0][1])
# print()

print(a[0][1][1])

02-302-3333

In [25]:
for idx, row in dat.iterrows():
    print(idx, row[0], row[1])

0 홍길동 02-302-3333
1 김길동 010-222-3334
2 박길동 010-1234-1234
3 nan 02-302-3333
4 홍길동 7777777

In [26]:
dat

    이름           전화번호   주소
0  홍길동    02-302-3333   광주
1  김길동   010-222-3334   부산
2  박길동  010-1234-1234   대구
3  NaN    02-302-3333  NaN
4  홍길동        7777777  NaN

In [27]:
dat_ori = dat.copy()

In [28]:
dat['이름']

0    홍길동
1    김길동
2    박길동
3    NaN
4    홍길동
Name: 이름, dtype: object

In [33]:
# dat.loc[row, col]
dat.loc[dat['이름'].isnull(), :]
dat.loc[dat['이름'].isnull(), '이름체크'] = 'NOK'

In [34]:
dat.loc[dat['이름'].notnull(), :]
dat.loc[dat['이름'].notnull(), '이름체크'] = 'OK'

In [35]:
dat

    이름           전화번호   주소 이름체크
0  홍길동    02-302-3333   광주   OK
1  김길동   010-222-3334   부산   OK
2  박길동  010-1234-1234   대구   OK
3  NaN    02-302-3333  NaN  NOK
4  홍길동        7777777  NaN   OK

# 실습
 * 전화번호가 있는지 없는지 체크해보기

In [36]:
dat.loc[dat['전화번호'].isnull(), '전화번호체크'] = 'NOK'
dat.loc[dat['전화번호'].notnull(), '전화번호체크'] = 'OK'
dat

    이름           전화번호   주소 이름체크 전화번호체크
0  홍길동    02-302-3333   광주   OK     OK
1  김길동   010-222-3334   부산   OK     OK
2  박길동  010-1234-1234   대구   OK     OK
3  NaN    02-302-3333  NaN  NOK     OK
4  홍길동        7777777  NaN   OK     OK

In [41]:
dat['전화번호'].str.len() > 12

0    False
1    False
2     True
3    False
4    False
Name: 전화번호, dtype: bool

In [42]:
dat['전화번호'].str.len() < 13

0     True
1     True
2    False
3     True
4     True
Name: 전화번호, dtype: bool

In [44]:
(dat['전화번호'].str.len() > 12) & (dat['전화번호'].str.len() < 13)

0    False
1    False
2    False
3    False
4    False
Name: 전화번호, dtype: bool

In [53]:
phone_number_len_check = (dat['전화번호'].str.len() == 12) | (dat['전화번호'].str.len() == 13)

In [54]:
dat.loc[phone_number_len_check, '전화번호길이체크'] = 'OK'
dat.loc[~phone_number_len_check, '전화번호길이체크'] = 'NOK'
dat

    이름           전화번호   주소 이름체크 전화번호체크 전화번호길이체크
0  홍길동    02-302-3333   광주   OK     OK      NOK
1  김길동   010-222-3334   부산   OK     OK       OK
2  박길동  010-1234-1234   대구   OK     OK       OK
3  NaN    02-302-3333  NaN  NOK     OK      NOK
4  홍길동        7777777  NaN   OK     OK      NOK

In [67]:
phone_number_reg_check = dat['전화번호'].str.contains(r'\d{2,3}-\d{3,4}-\d{4}$')
dat.loc[phone_number_reg_check, '전화번호형식체크'] = 'OK'
dat.loc[~phone_number_reg_check, '전화번호형식체크'] = 'NOK'
dat

    이름           전화번호   주소 이름체크 전화번호체크 전화번호길이체크 전화번호형식체크
0  홍길동    02-302-3333   광주   OK     OK      NOK       OK
1  김길동   010-222-3334   부산   OK     OK       OK       OK
2  박길동  010-1234-1234   대구   OK     OK       OK       OK
3  NaN    02-302-3333  NaN  NOK     OK      NOK       OK
4  홍길동        7777777  NaN   OK     OK      NOK      NOK

In [109]:
dat['NOK개수'] = (dat[['이름체크', '전화번호체크', '전화번호길이체크', '전화번호형식체크']] == 'NOK').sum(axis='columns')
dat

    이름           전화번호   주소 이름체크 전화번호체크 전화번호길이체크 전화번호형식체크  NOK개수
0  홍길동    02-302-3333   광주   OK     OK      NOK       OK      1
1  김길동   010-222-3334   부산   OK     OK       OK       OK      0
2  박길동  010-1234-1234   대구   OK     OK       OK       OK      0
3  NaN    02-302-3333  NaN  NOK     OK      NOK       OK      2
4  홍길동        7777777  NaN   OK     OK      NOK      NOK      2

In [110]:
writer = pd.ExcelWriter('주소록_chk.xlsx', engine='openpyxl')
dat_ori.to_excel(writer, sheet_name='sheet_ori', index=False)
dat.to_excel(writer, sheet_name='sheet_chk', index=False)
writer.save()